In [ ]:
# пример  одноразовой таблицей в оперативной памяти компьютера

In [41]:
import pandas as pd
import numpy as np

In [42]:
from sqlalchemy import create_engine

In [43]:
temp_db = create_engine('sqlite:///:memory:')

In [44]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a','b','c', 'd'])

In [45]:
df

    a   b   c   d
0  52  80  51  63
1  97  23  74  35
2  84  89  31  74
3  33  31  56  58

In [46]:
df.to_sql(name='new_table',con=temp_db)

4

In [48]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [49]:
new_df

   index   a   b   c   d
0      0  52  80  51  63
1      1  97  23  74  35
2      2  84  89  31  74
3      3  33  31  56  58

In [51]:
pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

    a   c
0  52  51
1  97  74
2  84  31
3  33  56